In [1]:
import numpy as np
import pandas as pd
from numpy import where as IF
import datetime as dt

1. Import the customer data into python

In [2]:
Customers=pd.read_csv('C:\\Users\\Yash\\Desktop\\STATS\\CASE STUDY FOR PANDAS\\10. Additional Practice Exercises\\3. Pandas Case Study-1\\Customers.csv',encoding= 'unicode_escape')
Customers.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0
2,130363481,M,20130221,West,Gujarat,Surat,20130221,West,Gujarat,Surat,523.0,1,10.0,0.0
3,49817480,M,20130222,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,5132.0,1,170.0,0.0
4,126343829,F,20130301,North,Delhi,Delhi,20130301,North,Delhi,Delhi,1008.0,1,60.0,0.0

2. Understand the data using different functions and attributes like Customers, index, columns, dtypes.ndim, info(), get_dtype_counts etc.

In [3]:
Customers.shape

(10000, 14)

In [4]:
Customers.index

RangeIndex(start=0, stop=10000, step=1)

In [5]:
Customers.columns

Index(['Customer_ID', 'Gender', 'First_Date', 'First_region', 'First_state',
       'First_city', 'Recent_Date', 'Last_region', 'Last_state', 'Last_city',
       'Customer_Value', 'Buy_Times', 'Points_Earned', 'Points_Redeemed'],
      dtype='object')

In [6]:
Customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Customer_ID      10000 non-null  int64
 1   Gender           9986 non-null   object
 2   First_Date       10000 non-null  int64
 3   First_region     9979 non-null   object
 4   First_state      9983 non-null   object
 5   First_city       10000 non-null  object
 6   Recent_Date      10000 non-null  int64
 7   Last_region      10000 non-null  object
 8   Last_state       10000 non-null  object
 9   Last_city        10000 non-null  object
 10  Customer_Value   9964 non-null   float64
 11  Buy_Times        10000 non-null  int64
 12  Points_Earned    9979 non-null   float64
 13  Points_Redeemed  9988 non-null   float64
dtypes: float64(3), int64(4), object(7)
memory usage: 1.1+ MB

In [7]:
Customers.count()

Customer_ID        10000
Gender              9986
First_Date         10000
First_region        9979
First_state         9983
First_city         10000
Recent_Date        10000
Last_region        10000
Last_state         10000
Last_city          10000
Customer_Value      9964
Buy_Times          10000
Points_Earned       9979
Points_Redeemed     9988
dtype: int64

In [8]:
Customers.describe()

,Customer_ID,First_Date,Recent_Date,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed
count,1.000000e+04,1.000000e+04,1.000000e+04,9.964000e+03,10000.000000,9979.000000,9.988000e+03
mean,8.347904e+07,2.012199e+07,2.012537e+07,1.254489e+04,5.477600,529.355747,5.822111e+02
std,4.802529e+07,3.424373e+03,4.744995e+03,6.546771e+04,11.677831,1861.315677,1.521278e+04
min,5.850000e+02,2.012010e+07,2.012010e+07,0.000000e+00,1.000000,0.000000,0.000000e+00
25%,3.617353e+07,2.012023e+07,2.012082e+07,1.484500e+03,1.000000,65.000000,0.000000e+00
50%,1.146933e+08,2.012070e+07,2.012122e+07,3.960001e+03,2.000000,195.000000,0.000000e+00
75%,1.216234e+08,2.012111e+07,2.013030e+07,1.113600e+04,6.000000,535.000000,0.000000e+00
max,1.324735e+08,2.013033e+07,2.013033e+07,5.098715e+06,586.000000,142030.000000,1.387520e+06

3. What is percentage of missing values for customer Value variable?

In [9]:
Customers.isna().mean().round(4) * 100

Customer_ID        0.00
Gender             0.14
First_Date         0.00
First_region       0.21
First_state        0.17
First_city         0.00
Recent_Date        0.00
Last_region        0.00
Last_state         0.00
Last_city          0.00
Customer_Value     0.36
Buy_Times          0.00
Points_Earned      0.21
Points_Redeemed    0.12
dtype: float64

4. Create two subsets with unique and duplicate values

In [10]:

dupItems = []
uniqItems = {}
for x in Customers:
   if x not in uniqItems:
      uniqItems[x] = 1
   else:
      if uniqItems[x] == 1:
         dupItems.append(x)
      uniqItems[x] += 1
print(dupItems)
print(uniqItems)

[]
{'Customer_ID': 1, 'Gender': 1, 'First_Date': 1, 'First_region': 1, 'First_state': 1, 'First_city': 1, 'Recent_Date': 1, 'Last_region': 1, 'Last_state': 1, 'Last_city': 1, 'Customer_Value': 1, 'Buy_Times': 1, 'Points_Earned': 1, 'Points_Redeemed': 1}

5. Create data set with list of customers whose customer value greater than 10000

In [11]:
a= Customers[Customers['Customer_Value']> 10000].reset_index(drop= True)

In [12]:
a.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed
0,1610085,F,20120103,North,Delhi,Delhi,20121013,North,Delhi,Delhi,10380.199,6,1189.0,0.0
1,7518872,M,20120104,North,Uttar Pradesh,Kanpur,20130123,North,Uttar Pradesh,Kanpur,14587.000,6,865.0,0.0
2,63508964,M,20120106,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,145472.702,36,680.0,16635.0
3,23667984,F,20120107,West,Maharashtra,Nagpur,20130313,West,Maharashtra,Nagpur,19640.700,12,268.0,2549.0
4,84634600,M,20120108,South,Karnataka,Bangalore,20130307,South,Karnataka,Bangalore,32377.602,22,1029.0,1771.0

6. In customer table, create a new variable called “customer value segment” using customer value as follows. -
- High Value Segment - > 25000
- Medium Value Segment – Between 10000 and 25000
- Low Value Segment – less than or equal to 10000

In [13]:
Customer_value_segment= Customers.Customer_Value

Customers['Customer_value_segment']= IF(Customer_value_segment > 25000, 'High Value Segment', 
                                        IF((Customer_value_segment > 10000) & (Customer_value_segment < 25000),'Medium Value Segment','Low Value Segment'))

In [14]:
Customers.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed,Customer_value_segment
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0,Low Value Segment
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0,Low Value Segment
2,130363481,M,20130221,West,Gujarat,Surat,20130221,West,Gujarat,Surat,523.0,1,10.0,0.0,Low Value Segment
3,49817480,M,20130222,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,5132.0,1,170.0,0.0,Low Value Segment
4,126343829,F,20130301,North,Delhi,Delhi,20130301,North,Delhi,Delhi,1008.0,1,60.0,0.0,Low Value Segment

7. Create variables “average revenue per trip” and “balance points” in the customer data set

In [15]:
Customers = Customers.assign(average_revenue= Customers.Customer_Value/Customers.Buy_Times,Balance_Points=Customers.Points_Earned - Customers.Points_Redeemed )

In [16]:
Customers.head()

,Customer_ID,Gender,First_Date,First_region,First_state,First_city,Recent_Date,Last_region,Last_state,Last_city,Customer_Value,Buy_Times,Points_Earned,Points_Redeemed,Customer_value_segment,average_revenue,Balance_Points
0,129609144,M,20130130,West,Gujarat,Surat,20130216,West,Gujarat,Surat,2032.0,2,200.0,0.0,Low Value Segment,1016.0,200.0
1,129627580,M,20130129,North,Delhi,Delhi,20130129,North,Delhi,Delhi,1709.0,1,100.0,0.0,Low Value Segment,1709.0,100.0
2,130363481,M,20130221,West,Gujarat,Surat,20130221,West,Gujarat,Surat,523.0,1,10.0,0.0,Low Value Segment,523.0,10.0
3,49817480,M,20130222,West,Maharashtra,Pimpri-Chinchwad,20130222,West,Maharashtra,Pimpri-Chinchwad,5132.0,1,170.0,0.0,Low Value Segment,5132.0,170.0
4,126343829,F,20130301,North,Delhi,Delhi,20130301,North,Delhi,Delhi,1008.0,1,60.0,0.0,Low Value Segment,1008.0,60.0

8. How many days between last purchase date and today?

In [17]:
Presnet_day = pd.to_datetime(dt.datetime.now().date())
purchase_date = Presnet_day - pd.to_datetime(Customers.Recent_Date,format= '%Y%m%d')

In [18]:
purchase_date.head()

0   2705 days
1   2723 days
2   2700 days
3   2699 days
4   2692 days
Name: Recent_Date, dtype: timedelta64[ns]

9. Calculate percentage of sales by each last city, state and region

In [19]:
percentage= Customers[[ 'Last_city','Last_state','Last_region','Customer_Value']]
percentage.head()

          Last_city   Last_state Last_region  Customer_Value
0             Surat      Gujarat        West          2032.0
1             Delhi        Delhi       North          1709.0
2             Surat      Gujarat        West           523.0
3  Pimpri-Chinchwad  Maharashtra        West          5132.0
4             Delhi        Delhi       North          1008.0

In [20]:
percentage.groupby(['Last_region', 'Last_state', 'Last_city'])['Customer_Value'].sum()/percentage.Customer_Value.sum()

Last_region  Last_state   Last_city
East         Assam        Guwahati            0.015573
             Bihar        Begusarai           0.000206
                          Bhagalpur           0.000022
                          Katihar             0.000469
                          Patna               0.001851
                                                ...
West         Maharashtra  Navi Mumbai         0.000106
                          Pimpri-Chinchwad    0.033146
                          Thane               0.002372
                          Ulhasnagar          0.000057
                          Vasai-Virar         0.000860
Name: Customer_Value, Length: 116, dtype: float64

10. What is the count of customers, average number of purchases and average purchase transaction value by last state and city.

In [21]:
Customers.groupby(['Last_state', 'Last_city'])['Customer_ID'].count()

Last_state      Last_city
Andhra Pradesh  Guntur               1
                Kurnool              1
                Tirupati             2
                Vijayawada          20
                Visakhapatnam      117
                                  ...
West Bengal     Kolkata            543
                North Dumdum         3
                Panihati             1
                Rajpur Sonarpur      2
                Siliguri             1
Name: Customer_ID, Length: 116, dtype: int64

In [22]:
Customers.groupby(['Last_state', 'Last_city'])['Buy_Times'].count()

Last_state      Last_city
Andhra Pradesh  Guntur               1
                Kurnool              1
                Tirupati             2
                Vijayawada          20
                Visakhapatnam      117
                                  ...
West Bengal     Kolkata            543
                North Dumdum         3
                Panihati             1
                Rajpur Sonarpur      2
                Siliguri             1
Name: Buy_Times, Length: 116, dtype: int64

In [23]:
Customers.groupby(['Last_state', 'Last_city'])['average_revenue'].mean()

Last_state      Last_city
Andhra Pradesh  Guntur                0.000000
                Kurnool             778.374750
                Tirupati           1828.333333
                Vijayawada         1981.191171
                Visakhapatnam      2383.914601
                                      ...
West Bengal     Kolkata            2107.631101
                North Dumdum       3307.377778
                Panihati            989.000429
                Rajpur Sonarpur     541.500000
                Siliguri           2594.750000
Name: average_revenue, Length: 116, dtype: float64